Tekla Open API Reference for Tekla Structures 2025
TeklaProgressBar Properties
The TeklaProgressBar type exposes the following members.
Properties
Name | Description
Text
Gets or sets the current message text of the progress bar.
Value
Gets or sets the current position of the progress bar.
Top
See Also
Reference
TeklaProgressBar Class
Tekla.Structures.Dialog Namespace